[
  {
    "path": "lessons/2022-06-03-chronic-wasting-disease/",
    "title": "Alberta Chronic Wasting Disease Tutorial",
    "description": "This interactive tutorial explores how a simple compartmental model (the SI model) can be used to track and predict the spread of Chronic Wasting Disease (CWD) in Albertan mule deer over time. It begins by introducing CWD and why it is a growing problem in Albertan mule deer. It then investigates and explains how different levels of transmission, death, and culling can change disease dynamics. Students can test how these different parameters influence the spread of CWD using the sliders on each page.",
    "author": [
      {
        "name": "Amy Forsythe",
        "url": {}
      },
      {
        "name": "Bryn Wiley",
        "url": {}
      }
    ],
    "date": "2022-06-03",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-03T15:01:20-07:00",
    "input_file": {}
  },
  {
    "path": "lessons/2022-04-07-alberta-trees-tutorial/",
    "title": "Alberta Trees Tutorial",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Jhoan Chavez",
        "url": {}
      },
      {
        "name": "Zihaohan Sang",
        "url": {}
      },
      {
        "name": "Rolando Trejo Pérez",
        "url": {}
      }
    ],
    "date": "2022-04-07",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-03T14:37:45-07:00",
    "input_file": {}
  },
  {
    "path": "lessons/2022-04-07-anticosti-historical-data-tutorial/",
    "title": "Anticosti Historical Data Tutorial",
    "description": "After the storm: Impacts of a hemlock looper outbreak on tree species in Anticosti Island, 1973",
    "author": [
      {
        "name": "Victoria Marie Glynn",
        "url": "mailto:victoria.glynn@mail.mcgill.ca"
      },
      {
        "name": "Maxime Fraser Franco",
        "url": "mailto:fraser_franco.maxime@courrier.uqam.ca"
      }
    ],
    "date": "2022-04-07",
    "categories": [],
    "contents": "\r\nThis tutorial uses a tree damage dataset from Anticosti Island during\r\na hemlock looper outbreak in 1973. The dataset can be found on the\r\ngovernment of Canada’s official data\r\nportal. We would like to thank Anne Cotton-Gagnon, MSc, and\r\nChristian Hébert, PhD, from Natural Resources Canada and the Laurentian\r\nForestry Centre for their insights on the original datasets and access\r\nto the reports and maps associated with such.\r\nThe tutorial was built with the free and open-source software\r\nenvironment R using the leanr package and and\r\ndeployed using Shiny. You can\r\nfind the project folders and files in this GitHub\r\nrepository.\r\nThe present tutorial was developed by Victoria Marie Glynn who is a\r\nPhD student at McGill University in Montréal, Québec, and Maxime Fraser\r\nFranco who is a PhD student at the Université du Québec à Montréal\r\n(UQAM) in Montréal, Québec. Please feel free to contact us if you have\r\nany question (you can do that by clicking on our names on this page\r\nheader).\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-06-03T14:37:45-07:00",
    "input_file": {}
  },
  {
    "path": "lessons/2022-04-07-codyn-tutorial/",
    "title": "Codyn Tutorial",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Jory Griffith",
        "url": {}
      },
      {
        "name": "Maggie Slein",
        "url": {}
      },
      {
        "name": "Egor Katkov",
        "url": {}
      }
    ],
    "date": "2022-04-07",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nLoad Packages\r\nLoad Data\r\nUsing\r\nthe codyn package to analyze diversity data over\r\ntime\r\nUsing\r\ncommunity_structure()\r\nSpecies Richness and\r\nEvenness\r\nPlot species richness\r\nPlot species evenness\r\n\r\n\r\nUsing\r\ncommunity_diversity()\r\nShannon’s diversity\r\nPlot Shannon’s diversity\r\n\r\nSimpson’s diversity\r\nPlot Simpson’s diversity\r\n\r\n\r\nActivity\r\n\r\nLoad Packages\r\nWe will be using the codyn package for this tutorial. We\r\nwill also use ggplot2 and dplyr for plotting\r\nand cleaning.\r\n\r\n\r\nlibrary(ggplot2)\r\nlibrary(codyn)\r\nlibrary(dplyr)\r\n\r\n\r\n\r\nLoad Data\r\nThese data are from the Turkey Lakes watershed experiment. This\r\ndataset contains the abundances of benthic invertebrate species measured\r\nin the May and June from 1995 to 2001. They recorded the type and number\r\nof invertebrates in an area of the stream, with 10 replicates per\r\nsampling event. These forests next to these streams were logged in 1997\r\nwith varying harvest intensities, with low, medium, and high intensity\r\nharvest and a control stream with no forest harvest. We will using the\r\ncodyn package to analyze the diversity of these benthic\r\ninvertebrates over time.\r\n\r\n\r\ndata<-read.csv(\"stream_invertebrates.csv\")\r\nhead(data)\r\n\r\n\r\n  year   species treatment replicate abundance\r\n1 1995 Alloperla   control         1         0\r\n2 1995 Alloperla   control         2         0\r\n3 1995 Alloperla   control         3         4\r\n4 1995 Alloperla   control         4         3\r\n5 1995 Alloperla   control         5         3\r\n6 1995 Alloperla   control         6         3\r\n\r\nFor many functions, the codyn package can only look at\r\ndata from one stream at a time. So first we will separate each stream\r\ninto it’s own data frame.\r\n\r\n\r\n# high intensity logging treatment\r\nsubset_codyn_high <- data %>%\r\n  filter(treatment == \"high\")\r\n# medium intensity logging treatment\r\nsubset_codyn_med <- data %>%\r\n  filter(treatment == \"medium\")\r\n# low intensity logging treatment\r\nsubset_codyn_low <- data %>%\r\n  filter(treatment == \"low\") \r\n# control stream (no logging)\r\nsubset_codyn_ctrl <- data %>%\r\n  filter(treatment==\"control\")\r\n\r\n\r\n\r\nUsing\r\nthe codyn package to analyze diversity data over time\r\nEcologists are often interested in how diversity changes over time in\r\none place. This is particularly interesting when you are looking at how\r\nspecies diversity responds to environmental change. This environmental\r\nchange can be a single disturbance event such as a forest fire or more\r\nlong-term change such as temperature increases due to climate change.\r\nThe Turkey Lakes dataset provides us with an opportunity to look at how\r\nthe diversity of benthic invertebrates changes over time and in response\r\nto logging. We can compare the diversity of different streams with\r\ndifferent logging intensities and we can also compare the diversity of\r\nstreams.\r\nThe codyn package allows us to analyze the change in\r\nbiodiversity over time using different metrics.\r\nUsing\r\ncommunity_structure()\r\ncommunity_structure() is a function in the package\r\ncodyn that calculates species richness and evenness.\r\nSpecies Richness and\r\nEvenness\r\nFor example, we can use community_structure() to look at\r\nthe change in species richness and evenness over time in one of the\r\nTurkey Lake streams. We will choose the stream with high logging\r\nintensity as an example. This function can only look at one stream at a\r\ntime so make sure to subset out the stream that you are interested\r\nin.\r\nLet’s take a look at the high intensity logging stream data.\r\n\r\n\r\nhead(subset_codyn_high)\r\n\r\n\r\n  year     species treatment replicate abundance\r\n1 1995 Amphinemura      high         1         9\r\n2 1995 Amphinemura      high         2        24\r\n3 1995 Amphinemura      high         3        53\r\n4 1995 Amphinemura      high         4        15\r\n5 1995 Amphinemura      high         5        59\r\n6 1995 Amphinemura      high         6        37\r\n\r\nAs you can see, there is a column for year, species, replicate, and\r\nabundance.\r\nThe community structure function has five arguments. The first is\r\ndf where you put in the data frame of interest, in our case\r\nsubset_codyn_high. The time.var argument is\r\nwhere you put in your time variable (year), the\r\nabundance.var argument is where you put the column that holds the\r\nabundance variable (abundance) and the\r\nreplicate.var argument holds the column with the replicates\r\n(replicate). In the metric argument, you can\r\nspecify the metric of evenness that you want the function to calculate.\r\nThere are three possible metrics: Evar,\r\nSimpsonEvenness, and EQ, which all calculate\r\nevenness in different ways. We will use Simpson’s Evenness in this\r\ntutorial. Remember, if you ever need a refresher on the syntax you can\r\ntype ?community_structure into the R script.\r\n\r\n\r\nrichness_high<-community_structure(df=subset_codyn_high, time.var=\"year\", abundance.var=\"abundance\",\r\n                                   replicate.var=\"replicate\", metric=\"SimpsonEvenness\")\r\n\r\n\r\n\r\nWe can take a look at the output.\r\n\r\n\r\nhead(richness_high)\r\n\r\n\r\n  year replicate richness SimpsonEvenness\r\n1 1995         1       17       0.2210248\r\n2 1996         1       11       0.5785671\r\n3 1997         1       16       0.3436584\r\n4 1998         1       18       0.2786702\r\n5 1999         1       15       0.3540228\r\n6 2001         1       23       0.2661854\r\n\r\nAs you can see, this returns a data frame with the year, replicate,\r\nrichness calculation, and evenness measure. It calculates richness and\r\nevenness separately for each replicate sample in the stream, so we have\r\na measure of variability within samples as well as variability across\r\nyears.\r\nPlot species richness\r\nWe can plot this data frame to see the changes over time.\r\n\r\n\r\n\r\nHere is a plot of species richness, with a different value for each\r\nreplicate. The red line is the year that the streams were logged. Do you\r\nsee any change? Do you think there are any significant patterns? How\r\ndoes the variability between replicates compare to the variability\r\nbetween years?\r\nPlot species evenness\r\nWe can also plot species evenness over time.\r\n\r\n\r\n\r\nDo you see any patterns in the evenness between years?\r\nUsing\r\ncommunity_diversity()\r\nShannon’s diversity\r\nSpecies richness and evenness are very simple ways to look at species\r\ndiversity. However, as you learned from the rank abundance curves,\r\nspecies have different abundances within the community, with some\r\nspecies having very high abundance and most species having low\r\nabundance. Species richness does not take into account the relative\r\nabundances of each species, which limits the inferences we can make. The\r\nShannon-Weiner diversity metric does take into account these relative\r\nabundances when calculating the diversity of a community and allows us\r\nto make more meaningful inferences about how biodiversity is changing\r\nover time.\r\nThe codyn package allows you to calculate the Shannon\r\ndiversity index for a single site over time using the\r\ncommunity_diversity() function. We will again use the data\r\nfrom the stream with the high logging intensity. Luckily, this function\r\nhas the exact same syntax as the community_structure()\r\nfunction! The only difference is that the options for the\r\nmetric argument are Shannon and\r\nInverseSimpson. We will first use Shannon.\r\n\r\n\r\nshannon_div_high<-community_diversity(df=subset_codyn_high, time.var=\"year\", abundance.var=\"abundance\",\r\n                                      replicate.var=\"replicate\", metric=\"Shannon\")\r\n\r\n\r\n\r\nLet’s take a look at the output for this function.\r\n\r\n\r\nhead(shannon_div_high)\r\n\r\n\r\n  year replicate  Shannon\r\n1 1995         1 1.836002\r\n2 1996         1 2.044210\r\n3 1997         1 2.107977\r\n4 1998         1 2.016146\r\n5 1999         1 1.948510\r\n6 2001         1 2.297970\r\n\r\nYou can see it gives us a data frame of year,\r\nreplicate, and Shannon, which is our measure\r\nof Shannon diversity.\r\nPlot Shannon’s diversity\r\nWe can plot these to see change over time.\r\n\r\n\r\nggplot()+\r\n  geom_point(shannon_div_high, mapping=aes(x=year, y=Shannon))+\r\n  theme_classic()+\r\n  labs(y=\"Shannon Diversity\", x=\"Year\")+\r\n  geom_vline(xintercept=1997, linetype=2, color=\"red\")\r\n\r\n\r\n\r\n\r\nSimpson’s diversity\r\nWe can also use the same function to calculate Simpson’s diversity by\r\nsimply changing the metric argument to\r\nInverseSimpson.\r\n\r\n\r\nsimpson_div_high<-community_diversity(df=subset_codyn_high, time.var=\"year\", abundance.var=\"abundance\",\r\n                                      replicate.var=\"replicate\", metric=\"InverseSimpson\")\r\n\r\n\r\n\r\nWe can look at the output.\r\n\r\n\r\nhead(simpson_div_high)\r\n\r\n\r\n  year replicate InverseSimpson\r\n1 1995         1       3.757421\r\n2 1996         1       6.364238\r\n3 1997         1       5.498534\r\n4 1998         1       5.016063\r\n5 1999         1       5.310341\r\n6 2001         1       6.122265\r\n\r\nPlot Simpson’s diversity\r\nAnd then plot.\r\n\r\n\r\n\r\nHow do these patterns compare to the patterns of Shannon’s diversity\r\nover time? How do the values compare?\r\nActivity\r\nCalculate richness, evenness, and diversity using both the Shannon\r\nand Simpson indices for the streams with low intensity logging, high\r\nintensity logging, and no logging. The data for these streams are\r\nsubset_codyn_low, subset_codyn_high, and\r\nsubset_codyn_ctrl. Plot these indices. Do you see any\r\npatterns across years? How do these compare to the patterns in the high\r\nintensity logging stream?\r\n\r\n\r\n\r\n",
    "preview": "lessons/2022-04-07-codyn-tutorial/codyn-tutorial_files/figure-html5/unnamed-chunk-7-1.png",
    "last_modified": "2022-06-03T14:37:46-07:00",
    "input_file": {}
  },
  {
    "path": "lessons/2022-04-07-sexual-dimorphism-and-sexual-selection/",
    "title": "Sexual Dimorphism and Sexual Selection",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Elizabeth Houghton",
        "url": {}
      },
      {
        "name": "Kirsten Palmier",
        "url": {}
      }
    ],
    "date": "2022-04-07",
    "categories": [],
    "contents": "\r\nTutorial learning objectives\r\nIn this tutorial you will explore:\r\nWhether sexual dimorphism is present in a population of Tree\r\nSwallows found in Long Point, Ontario\r\nLife history traits of Tree Swallow\r\nTrade offs between the number of clutches a bird may have and the\r\nnumber of eggs in each clutch\r\nHow the sampled population of Tree Swallow’s birth rates have\r\nchanged over time\r\nBackground of datasets\r\nThis is a tutorial to get you familiar with R and explore ecological\r\nconcepts through a Tree Swallow nest productivity dataset. Before we\r\njump into the weeds, let’s get to know our dataset!\r\nThe Tree Swallow (Tachycineta bicolor) is one of the most\r\ncommon birds in eastern North America that normally nests in tree\r\ncavities excavated by other species like woodpeckers, but also readily\r\naccepts human made nest’ boxes. Based on this quality and their\r\nabundance, Birds Canada has monitored nest boxes of tree swallows around\r\nthe Long Point Biosphere Reserve, Ontario, from 1974 to 2014. Each year,\r\nMay through June, volunteer research assistants check nest box contents\r\ndaily, and band the adults and their young. Nest-box records are\r\navailable from about 300 boxes from 3-4 sites during this period. Data\r\ncollected includes nest box observations, clutch initiation dates,\r\nclutch size and egg weight, nest success, weather, insect abundance, and\r\nbanding data. This data set includes all data entry related to eggs,\r\nnests, nestlings, nest check observations, and banding data from 1977 to\r\n2014. More information on this dataset can be found here.\r\nAdditionally, in 2021, this dataset was quality checked and made open\r\naccess by Jonathan Diamond through a Data Rescue internship with the Living Data Project,\r\nan initiative through the Canadian Institute of Ecology and Evolution\r\nthat rescues legacy datasets.\r\n\r\nThrough Bird Studies Canada, Long Point Bird Observatory monitored\r\nthree nest box “colonies” of Tree Swallows at Long Point, two on the\r\n“mainland” near Port Rowan (at the Port Rowan sewagelagoons and adjacent\r\nto agricultural land at mudd creek) and the third at the tip of the\r\nPoint.\r\nThe Point\r\nThis colony was established in its present location in 1969. The nest\r\nboxes are located about 1 km west of the Tip of the point and are\r\narranged 24.4m apart in a grid of numbered (north-south) rows and\r\nlettered (east-west) columns. Each box is designated by its position, so\r\nbox 10G is in row 10 and column G. At the present time the rows in use\r\nare 1-19 and the letters are D-K, but many positions are unfilled and\r\nthere are a total of 64 boxes.\r\n\r\nThe Sewage Lagoon\r\nThis colony was first established in 1977 and has since been expanded\r\nto a total of 77 boxes. The boxes are in two rows around the lagoon\r\nembankment, as well as across the street in a small cluster of 5\r\nboxes.\r\n\r\nMud Creek\r\nEstablished in 1987, the Mud Creek site is located 3.25 km\r\nnorth-northeast of Sewage Lagoon and contains 80 nest boxes. The habitat\r\nis an open, uncultivated field adjacent to a small woodlot.\r\n\r\nFor this tutorial we will be looking at the banding dataset which\r\nadults were trapped sometime between the first young hatch and when they\r\nwere 12 days old. All adult birds are banded, unless previously banded.\r\nIt was also recorded if the bird had a brood patch (BP) or cloacal\r\nprotuberance (CP). Plumage color was recorded as blue (BLU), Brown\r\n(BRN), or Intermediate (INT). Furthermore, plumage categories and\r\nage/sex designations were assigned and a variety of size measurements\r\nwere taken:\r\nPlumage Categories\r\nBLU birds (ASY) More than 90% of the upper parts iridescent\r\nblue-green\r\nINT birds (AHY) More than 50% up to 90% of upper parts iridescent\r\nblue-green (remainder dull brown or brown tinged with green)\r\nBRN birds (SY) Up to 50% of upper parts iridescent blue-green\r\n(remainder > 50% dull brown or brown tinged with green)\r\nSex Categories\r\nMale = M\r\nFemale = F\r\nMeasurements of Size and\r\nWeight\r\nWing chord length (mm) = wing_chord\r\nWing chord flat (mm) = wing_flat\r\nTail length (mm) = tail\r\np_9 = primary feather length\r\n\r\nAdults are blue-green above with white below with blacking flight\r\nfeathers. Photo courtesy of Max Nootbaar from the Macaulay\r\nLibrary.\r\n\r\nFirst year females may be brownish above with hints of blue-green;\r\nadult females can be nearly blue-green as males. Photo courtesy of Matt\r\nDavis from the Macaulay\r\nLibrary\r\nImporting data and packages\r\nIn this tutorial, we will be working with Tree Swallow data collected by\r\nBird Studies Canada, Long Point Bird Observatory as well as a few\r\nadditional packages. Run the following code to import the required\r\npackages and pull in the dataset that we will be working with throughout\r\nthis tutorial.\r\n\r\n\r\nlibrary(dplyr)\r\nlibrary(ggplot2)\r\nlibrary(tidyr)\r\nlibrary(lubridate)\r\nlibrary(reshape)\r\nlibrary(readr)\r\nlibrary(ggpubr)\r\n\r\nbanding <- read.csv(\"TRES/banding_final.csv\")\r\nbanding_nest <- read.csv(\"TRES/banding_nest_final.csv\")\r\nnest <- read.csv(\"TRES/nest_final.csv\")\r\n\r\n\r\n\r\n\r\n\r\n# Now, we want to make sure the class of our data is correct before we move forward:\r\nstr(banding)\r\n\r\n\r\n'data.frame':   1602 obs. of  13 variables:\r\n $ band_or_recapture: chr  \"R\" \"R\" \"R\" \"R\" ...\r\n $ band_number      : num  1831 1881 2171 1881 2351 ...\r\n $ sex              : chr  \"F\" \"F\" \"F\" \"M\" ...\r\n $ colour           : chr  \"BLU\" \"BLU\" \"BLU\" \"BLU\" ...\r\n $ wing_chord       : num  116 115 112 123 118 123 110 111 112 117 ...\r\n $ wing_flat        : num  119 119 114 124 119 125 112 113 114 118 ...\r\n $ tail             : num  58 54 55 60 58 56 55 52 55 54 ...\r\n $ p_9              : int  89 90 88 96 92 97 89 87 90 92 ...\r\n $ weight           : num  22 19.6 21.5 21.1 22.1 20.5 20 21.6 19.8 20.5 ...\r\n $ date             : chr  \"2010-06-01\" \"2010-06-01\" \"2010-06-01\" \"2010-06-01\" ...\r\n $ nest_box         : chr  \"PT4G\" \"PT2F\" \"PT15G\" \"PT4G\" ...\r\n $ age_code         : chr  \"ASY\" \"ASY\" \"ASY\" \"AHY\" ...\r\n $ year             : int  2010 2010 2010 2010 2010 2010 2010 2010 2010 2010 ...\r\n\r\n# lets go ahead and convert the sex and nest_box column class into factors:\r\nbanding$sex <- as.factor(banding$sex)\r\nbanding$nest_box <- as.factor(banding$nest_box)\r\n\r\n\r\nstr(banding_nest)\r\n\r\n\r\n'data.frame':   1002 obs. of  16 variables:\r\n $ band_number        : num  1671 1672 1672 1771 1771 ...\r\n $ year               : int  2010 2010 2010 2010 2010 2011 2011 2012 2010 2011 ...\r\n $ sex                : chr  \"M\" \"F\" \"F\" \"F\" ...\r\n $ colour             : chr  \"BLU\" \"BLU\" \"BLU\" \"BLU\" ...\r\n $ wing_chord         : num  116 120 118 120 116 115 114 109 112 115 ...\r\n $ wing_flat          : num  117 121 119 121 118 117 116 111 114 119 ...\r\n $ tail               : num  55 47 53 52 54 55 58 60 46 56 ...\r\n $ p_9                : int  89 92 93 95 91 95 88 88 92 91 ...\r\n $ weight             : num  20 22.5 23.8 19.7 19.5 ...\r\n $ date               : chr  \"2015-06-01\" \"2015-06-01\" \"2017-06-01\" \"2017-06-01\" ...\r\n $ nest_box           : chr  \"PT16I\" \"PT16I\" \"PT19F\" \"PT09F\" ...\r\n $ clutch_size        : int  6 6 5 6 4 3 6 6 4 5 ...\r\n $ clutch_number      : int  1 1 1 1 1 1 1 1 1 1 ...\r\n $ no_of_young_fledged: int  6 6 4 4 4 1 4 6 4 5 ...\r\n $ number_hatch       : int  6 6 4 4 4 2 6 6 4 5 ...\r\n $ location           : chr  \"PT\" \"PT\" \"PT\" \"PT\" ...\r\n\r\n# fix class\r\nbanding_nest$sex <- as.factor(banding_nest$sex)\r\nbanding_nest$nest_box <- as.factor(banding_nest$nest_box)\r\nbanding_nest$location <- as.factor(banding_nest$location)\r\n\r\nstr(banding_nest)\r\n\r\n\r\n'data.frame':   1002 obs. of  16 variables:\r\n $ band_number        : num  1671 1672 1672 1771 1771 ...\r\n $ year               : int  2010 2010 2010 2010 2010 2011 2011 2012 2010 2011 ...\r\n $ sex                : Factor w/ 2 levels \"F\",\"M\": 2 1 1 1 1 1 1 1 1 1 ...\r\n $ colour             : chr  \"BLU\" \"BLU\" \"BLU\" \"BLU\" ...\r\n $ wing_chord         : num  116 120 118 120 116 115 114 109 112 115 ...\r\n $ wing_flat          : num  117 121 119 121 118 117 116 111 114 119 ...\r\n $ tail               : num  55 47 53 52 54 55 58 60 46 56 ...\r\n $ p_9                : int  89 92 93 95 91 95 88 88 92 91 ...\r\n $ weight             : num  20 22.5 23.8 19.7 19.5 ...\r\n $ date               : chr  \"2015-06-01\" \"2015-06-01\" \"2017-06-01\" \"2017-06-01\" ...\r\n $ nest_box           : Factor w/ 218 levels \"MC01\",\"MC02\",..: 134 134 142 99 214 214 143 202 33 26 ...\r\n $ clutch_size        : int  6 6 5 6 4 3 6 6 4 5 ...\r\n $ clutch_number      : int  1 1 1 1 1 1 1 1 1 1 ...\r\n $ no_of_young_fledged: int  6 6 4 4 4 1 4 6 4 5 ...\r\n $ number_hatch       : int  6 6 4 4 4 2 6 6 4 5 ...\r\n $ location           : Factor w/ 3 levels \"MC\",\"PT\",\"SL\": 2 2 2 2 3 3 3 3 1 1 ...\r\n\r\n# fix class\r\nnest$nest_code <- as.factor(nest$nest_code)\r\nnest$location <- as.factor(nest$location)\r\n\r\n\r\n\r\nSexual dimorphism in tree\r\nswallows\r\nSexual dimorphism is defined as the phenotypic\r\nvariations within different sexes of the same species (Andersson 1994).\r\nDifferences can include size, weight, plumage (in birds). These\r\ndifferences are thought to arise through species that are part of a\r\nsocial mating system, in which there may be varying degrees of parental\r\ncare (Darwin 1871; Wallace 1889; Anderson 1994). This phenomenon is\r\noften seen in birds, where males are the larger sex and have more ornate\r\nplummage than females.\r\n[]!(TRES/ornate.png)\r\nImage from ThoughtCo..\r\nQuestion\r\nWhy do you think this phenomenon happens?\r\nWhy are females generally more drab?\r\nIn which instance to you think females would be more ornate than\r\nmales?\r\nAnswer:\r\n\r\n\r\n\r\nTo determine if sexual dimorphism exists in this\r\ntree swallow data were will get you to explore the average size\r\nmeasurements taken for each bird. Since birds were tracked using a band\r\nnumber, and birds may have been captured multiple times throughout their\r\nlife, so we will observe the differences in average size measurement\r\ntaken for each bird.\r\n\r\n\r\n# look at the following variable to see how they differ by gender : wing_chord, tail, and weight\r\n\r\n# will will take the mean of these measurements by band_number and gender\r\n\r\nwing_chord_grouped <- aggregate(wing_chord ~ band_number + sex, banding, mean)\r\n\r\n\r\n# Boxplot of these trends based on sex\r\n\r\nggplot(wing_chord_grouped, aes(factor(sex), wing_chord, fill=sex)) + \r\n  geom_boxplot() +\r\n  scale_fill_manual(\"\", values=c(\"M\"= \"lightskyblue\", \"F\"= \"plum3\")) + \r\n  xlab('') +\r\n  ylab('Wing Chord') +\r\n  ggtitle(\"Wing Chord vs. Sex\")\r\n\r\n\r\n\r\n\r\nTry coding\r\nLets go ahead and try calculating the mean tail length when grouped\r\nby sex and band number and graph boxplots of these values. Lets call the\r\ngrouped tail values ‘tail_grouped’ and grouped weight values\r\n‘weight_grouped’. Hint: think look at how we calculated these values for\r\nwing_chord.\r\n\r\n\r\n\r\nNow, to get a sense of how much the wind chord length, tail length,\r\nand weight differs between male and female tree swallows lets find the\r\nmean values of both the males and females.\r\n\r\n\r\n# We can calculate the mean female and male wing chord length by grouping the wing chord values by sex and finding the mean like this: \r\n\r\naggregate(wing_chord ~ sex, wing_chord_grouped, mean)\r\n\r\n\r\n  sex wing_chord\r\n1   F   113.5396\r\n2   M   117.9625\r\n\r\n# see how we are using the dataframe 'wing_chord_grouped' that we aggregated previously where we had already grouped our birds by band  number and sex?\r\n\r\n\r\n\r\nTry coding\r\nTry calculating the mean female and male tail length and weight\r\nvalues on your own.\r\n\r\n\r\n\r\nQuestions\r\nWhat is the average wing chord length, tail length, and weight of\r\nthe male tree swallows?\r\nWhat is the average wing chord length, tail length, and weight of\r\nthe female tree swallows?\r\nDo these findings suggest that there is some level of sexual\r\ndimorphism in tree swallows?\r\nWhat type of pressures could lead to sexual dimorphism in tree\r\nswallows?\r\nAnswer:\r\n\r\n\r\n\r\n\r\nAspects of Tree Swallow\r\nLife History\r\nTrade offs: Clutch\r\nsize vs. clutch number?\r\n\r\n\r\n# To visualize whether there may be a trade off between clutch size and the number of clutches in a nest lets visualize these factors in a box plot. The nest dataset contains records of the clutch numbers found in nest boxes across Long Point dating back to 1987!\r\n\r\n# lets take a quick look at the dataset first to figure out what we need to plot\r\nhead(nest)\r\n\r\n\r\n  year nest_box clutch_number location nest_code clutch_size\r\n1 1987     MC02             2       MC MC1987M02           3\r\n2 1987     MC03             1       MC MC1987M03           5\r\n3 1987     MC04             1       MC MC1987M04           4\r\n4 1987     MC07             1       MC MC1987M07           5\r\n5 1987     MC08             1       MC MC1987M08           6\r\n6 1987     MC10             1       MC MC1987M10           5\r\n\r\n# we want to look at how clutch size (clutch_size) may vary between the first and second clutch (clutch_number). Lets check these out using the plotting function ggplot\r\n\r\nggplot(nest, aes(factor(clutch_number), clutch_size)) + \r\n  geom_boxplot(outlier.colour=\"black\", outlier.size=0.5, position = position_dodge(preserve = \"single\")) +\r\n  xlab('Clutch Number') +\r\n  ylab('Clutch Size') +\r\n  ggtitle(\"Clutch Number vs. Clutch Size\") +\r\n  scale_y_continuous(breaks = seq(0, 13, by = 1)) +\r\n  theme(plot.title = element_text(hjust = 0.5))\r\n\r\n\r\n\r\n# What is the mean clutch size for the first and second clutch in a nest? This is how we would calculate the average clutch size for clutch number 1 and 2. See how we are finding the mean clutch size by the clutch number, pulling these values from the nest data set?\r\naggregate(clutch_size ~ clutch_number, nest, mean )\r\n\r\n\r\n  clutch_number clutch_size\r\n1             1    5.613377\r\n2             2    4.796196\r\n\r\nQuestion\r\nWhat is the average clutch size for the first and second\r\nclutches?\r\nAnswer:\r\nIt appears that second clutches are slightly smaller than first\r\nclutches! However, in order to confirm that there is a statistically\r\nsignificant difference between the two clutch sizes you would need to\r\ncomplete some sort of statistical analysis (e.g a t-test).\r\nDo larger birds have\r\nbigger clutches?\r\nIs the size and weight of the bird at maturity related to the clutch\r\nsize? Lets look at wing chord length, tail length, and bird weight to\r\ninvestigate this. Also, lets make sure we look at male and female birds\r\nseparately.\r\n\r\n\r\n# First, lets find the mean wing chord length when grouped by year, nest_box, sex, clutch_number, clutch_size and band number. This will help us deal with any repeated measurements taken of the same bird visiting the the same nest box multiple times in a season.\r\n\r\n# Here is how we find the mean wing chord length, we will store these calculation in the dataframe 'banding_nest.wing_chord'\r\n\r\nbanding_nest.wing_chord <- aggregate(wing_chord ~ year + sex + nest_box + clutch_number + band_number + clutch_size, banding_nest, mean)\r\n\r\n# Here is how we find the mean tail length, we will store these calculation in the dataframe 'banding_nest.tail'\r\n\r\nbanding_nest.tail <- aggregate(tail ~ year + sex + nest_box + clutch_number + band_number + clutch_size, banding_nest, mean)\r\n\r\n# Here is how we find the mean weight, we will store these calculation in the dataframe 'banding_nest.weight'\r\n\r\nbanding_nest.weight <- aggregate(weight ~ year + sex + nest_box + clutch_number + band_number + clutch_size, banding_nest, mean)\r\n\r\n# lets see if we see any patterns between the number of eggs there are per clutch (clutch_size) and the weight or size of the parent tree swallow\r\n\r\nplot(clutch_size ~ wing_chord, banding_nest.wing_chord,\r\n     main=\"Clutch Size vs Parent Wing Chord Length\",\r\n     pch=20,\r\n     col=sex,\r\n     xlab=\"Wing Chord Length (mm)\", \r\n     ylab=\"Clutch Size\")\r\nlegend(\"topright\", legend= levels(banding_nest.wing_chord$sex), # this adds a legend to out plots to tell us\r\n       col= 1:2, pch = 20, cex=0.9)\r\n\r\n\r\n\r\nplot(clutch_size ~ tail, banding_nest.tail,\r\n     main=\"Clutch Size vs Parent Tail Length\",\r\n     pch=20,\r\n     col=sex,\r\n     xlab=\"Tail Length (mm)\", \r\n     ylab=\"Clutch Size\")\r\nlegend(\"topright\", legend= levels(banding_nest.tail$sex),\r\n       col= 1:2, pch = 20, cex=0.9)\r\n\r\n\r\n\r\nplot(clutch_size ~ weight,banding_nest.weight,\r\n     main=\"Clutch size vs Parent Bird Weight\",\r\n     pch=20,\r\n     col=sex,\r\n     xlab=\"Weight (g)\", \r\n     ylab=\"Clutch Size\")\r\nlegend(\"topright\", legend= levels(banding_nest.weight$sex),\r\n       col= 1:2, pch = 20, cex=0.9)\r\n\r\n\r\n\r\n\r\nQuestion\r\nDo you notice any relationships between bird size and clutch\r\nsize?\r\nAnswer:\r\nChanges through time\r\nLastly, lets investigate if the average clutch size over time is\r\nchanging. Could bird birth rates be changing over time as a result of\r\nclimate change or other environmental shifts?\r\n\r\n\r\n# first we want to take the average clutch size that was sampled from all of the nest boxes each year\r\n\r\nnest.average <- aggregate(clutch_size ~ year, nest, mean)\r\n\r\n# next, we will graph these values and add a linear regression with the associated R-squared value to see if there is evidence of a trend!\r\n\r\nlm_clutch_size <- summary(lm(clutch_size ~ year, data= nest.average)) # this line helps helps us calculate linear regressions\r\nr2_0 <- lm_clutch_size$r.squared # this line helps us make R-squared labels\r\nrlabel_0 <- bquote(italic(R)^2 == .(format(r2_0, digits = 3))) # this line helps us make R-squared labels\r\nplot(clutch_size ~ year, data=nest.average,\r\n     main=\"Yearly Average Clutch Size over Time\",\r\n     pch=16,\r\n     xlab=\"Year\", \r\n     ylab=\"Yearly Average Clutch Size\",\r\n     cex.main=1.25, \r\n     cex.lab=1)\r\nabline(lm(clutch_size ~ year, data=nest.average)) # this line adds our linear regression to the plot\r\ntext(2010, 6.2, rlabel_0)  # this line adds our R-squared labels to the plot\r\n\r\n\r\n\r\n\r\nQuestion\r\nDo you notice any relationships between clutch size and year?\r\nAnswer:\r\nTake-homes\r\nAfter going through these data you have now had the opportunity to\r\nlearn a bit about tree swallows, and more specifically look at a\r\n‘community’ of tree swallows found in Long Point, ON. This population\r\nappeared to show signs of sexual dimorphism, where the male swallows had\r\nlonger wing chords and tails and were heavier. As well, we noticed that\r\nthere appeared t be a trade off between clutch size and the number of\r\nclutched in a nest. An important thing to not is that these\r\nrelationships were speculative and statistical analyses will be required\r\nto support these findings in this population.\r\nLastly, these data did not show trends of larger birds having more\r\neggs and we observed no conclusive temporal trends of changes in birth\r\nrates over time. It is not uncommon that data is collected with certain\r\nhypotheses in mind and trend or relationships are ultimately not found\r\nto support these hypotheses!\r\n\r\n\r\n\r\n",
    "preview": "lessons/2022-04-07-sexual-dimorphism-and-sexual-selection/sexual-dimorphism-and-sexual-selection_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2022-06-03T14:37:46-07:00",
    "input_file": {}
  },
  {
    "path": "lessons/2022-04-07-tree-swallow-dataset/",
    "title": "Tree Swallow Dataset",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Elizabeth Houghton",
        "url": {}
      },
      {
        "name": "Kirsten Palmier",
        "url": {}
      }
    ],
    "date": "2022-04-07",
    "categories": [],
    "contents": "\r\nTree Swallow Nest\r\nProductivity\r\nThis is a tutorial to get you familiar with R and explore ecological\r\nconcepts through a Tree Swallow nest productivity dataset. Before we\r\njump into the weeds, let’s get to know our dataset!\r\nThe Tree Swallow (Tachycineta bicolor) is one of the most\r\ncommon birds in eastern North America that normally nests in tree\r\ncavities excavated by other species like woodpeckers, but also readily\r\naccepts human made nest’ boxes. Based on this quality and their\r\nabundance, Birds Canada has monitored nest boxes of tree swallows around\r\nthe Long Point Biosphere Reserve, Ontario, from 1974 to 2014. Each year,\r\nMay through June, volunteer research assistants check nest box contents\r\ndaily, and band the adults and their young. Nest-box records are\r\navailable from about 300 boxes from 3-4 sites during this period. Data\r\ncollected includes nest box observations, clutch initiation dates,\r\nclutch size and egg weight, nest success, weather, insect abundance, and\r\nbanding data. This data set includes all data entry related to eggs,\r\nnests, nestlings, nest check observations, and banding data from 1977 to\r\n2014. More information on this dataset can be found here.\r\nAdditionally, in 2021, this dataset was quality checked and made open\r\naccess by Jonathan Diamond through a Data Rescue internship with the Living Data Project,\r\nan initiative through the Canadian Institute of Ecology and Evolution\r\nthat rescues legacy datasets.\r\n\r\nThrough Bird Studies Canada, Long Point Bird Observatory monitored\r\nthree nest box “colonies” of Tree Swallows at Long Point, two on the\r\n“mainland” near Port Rowan (at the Port Rowan sewagelagoons and adjacent\r\nto agricultural land at mudd creek) and the third at the tip of the\r\nPoint.\r\nThe Point\r\nThis colony was established in its present location in 1969. The nest\r\nboxes are located about 1 km west of the Tip of the point and are\r\narranged 24.4m apart in a grid of numbered (north-south) rows and\r\nlettered (east-west) columns. Each box is designated by its position, so\r\nbox 10G is in row 10 and column G. At the present time the rows in use\r\nare 1-19 and the letters are D-K, but many positions are unfilled and\r\nthere are a total of 64 boxes.\r\n\r\nThe Sewage Lagoon\r\nThis colony was first established in 1977 and has since been expanded\r\nto a total of 77 boxes. The boxes are in two rows around the lagoon\r\nembankment, as well as across the street in a small cluster of 5\r\nboxes.\r\n\r\nMud Creek\r\nEstablished in 1987, the Mud Creek site is located 3.25 km\r\nnorth-northeast of Sewage Lagoon and contains 80 nest boxes. The habitat\r\nis an open, uncultivated field adjacent to a small woodlot.\r\n\r\nTutorial Learning Objectives\r\nIn this tutorial you will learn how to:\r\nLearn to work with data within R studio\r\nUse simple commands in R (e.g., subsetting, changing class,\r\naggregating data)\r\nGraph a simple bar chart\r\nGraph a time series\r\n\r\nObserve trends in figures\r\nInstalling R\r\nTo navigate and complete the following tutorials you will be required\r\nto install R and we encourage you to install R Studio.\r\nR is a freely available software and the most recent\r\nversion of R can be downloaded from: https://cran.r-project.org. After you have installed\r\nR, we encourage you to download R Studio as it provides a\r\nmore user friendly interface to interact with R. R Studio\r\nDesktop is freely available from https://rstudio.com/products/rstudio/download/.\r\nThe final piece of software that is required for completing the\r\npracticals is rmarkdown. R Markdown documents weave\r\ntogether narrative text and code to produce formatted, fully\r\nreproducible outputs. If you are unfamiliar with R Markdown, a short\r\ntutorial is available from https://rmarkdown.rstudio.com/articles_intro.html.\r\nOverview of R concepts\r\nIn this next section we are going to walk you through a few of the\r\nconcepts you need to understand in order to work with data in\r\nR.\r\nImporting data and packages\r\nIn order to work with certain set of data in R, you must first pull\r\nthem into the program.\r\n\r\n\r\n# Before we can pull packages into 'R', you will first have to install them onto your computer. Run the following code to download the required packages (without the #s, you only need to install them once):\r\n\r\n# install.packages(\"dplyr\")\r\n# install.packages(\"ggplot2\")\r\n# install.packages(\"tidyr\")\r\n# install.packages(\"lubridate\")\r\n# install.packages(\"reshape\")\r\n# install.packages(\"readr\")\r\n\r\n# Now we can start running those packages by calling on them using the following code:\r\n\r\nlibrary(dplyr)\r\nlibrary(ggplot2)\r\nlibrary(tidyr)\r\nlibrary(lubridate)\r\nlibrary(reshape)\r\nlibrary(readr)\r\n\r\nbanding <- read.csv(\"TRES/banding_final.csv\") #this dataset set contains banding information\r\n\r\nnest <- read.csv(\"TRES/nest_final.csv\") #this dataset contains nest information\r\n\r\nnestling <- read.csv(\"TRES/nestling_final.csv\") #this dataset contains nestling information\r\n\r\n\r\n\r\nData Exploration\r\nLet’s do some data exploring! First, let’s see what is in the banding\r\ndataset. This will help give us a better idea of what we can look\r\nat.\r\n\r\n\r\n#look into the first few rows of the banding dataset. You can do this using the head() function\r\nhead(banding) #where head() is the function and banding is the dataset\r\n\r\n\r\n  band_or_recapture band_number sex colour wing_chord wing_flat tail\r\n1                 R    1831.386   F    BLU        116       119   58\r\n2                 R    1881.065   F    BLU        115       119   54\r\n3                 R    2171.200   F    BLU        112       114   55\r\n4                 R    1881.064   M    BLU        123       124   60\r\n5                 B    2351.397   M    BLU        118       119   58\r\n6                 R    1881.042   M    BLU        123       125   56\r\n  p_9 weight       date nest_box age_code year\r\n1  89   22.0 2010-06-01     PT4G      ASY 2010\r\n2  90   19.6 2010-06-01     PT2F      ASY 2010\r\n3  88   21.5 2010-06-01    PT15G      ASY 2010\r\n4  96   21.1 2010-06-01     PT4G      AHY 2010\r\n5  92   22.1 2010-06-01    PT15G      AHY 2010\r\n6  97   20.5 2010-06-01     PT2F      AHY 2010\r\n\r\nYou can dig in deeper by using the summary() and str() functions\r\n\r\n\r\n#summarise the banding dataset\r\nsummary(banding) \r\n\r\n\r\n band_or_recapture   band_number       sex           \r\n Length:1602        Min.   :1381   Length:1602       \r\n Class :character   1st Qu.:2312   Class :character  \r\n Mode  :character   Median :2351   Mode  :character  \r\n                    Mean   :2310                     \r\n                    3rd Qu.:2402                     \r\n                    Max.   :5212                     \r\n    colour            wing_chord      wing_flat          tail      \r\n Length:1602        Min.   :100.0   Min.   :102.0   Min.   :44.00  \r\n Class :character   1st Qu.:113.0   1st Qu.:115.0   1st Qu.:53.00  \r\n Mode  :character   Median :116.0   Median :118.0   Median :55.00  \r\n                    Mean   :115.7   Mean   :117.9   Mean   :54.98  \r\n                    3rd Qu.:118.0   3rd Qu.:121.0   3rd Qu.:57.00  \r\n                    Max.   :129.0   Max.   :130.0   Max.   :69.00  \r\n      p_9             weight          date          \r\n Min.   : 78.00   Min.   :16.50   Length:1602       \r\n 1st Qu.: 90.00   1st Qu.:19.80   Class :character  \r\n Median : 92.00   Median :20.50   Mode  :character  \r\n Mean   : 92.39   Mean   :20.58                     \r\n 3rd Qu.: 95.00   3rd Qu.:21.40                     \r\n Max.   :109.00   Max.   :25.90                     \r\n   nest_box           age_code              year     \r\n Length:1602        Length:1602        Min.   :2010  \r\n Class :character   Class :character   1st Qu.:2011  \r\n Mode  :character   Mode  :character   Median :2012  \r\n                                       Mean   :2012  \r\n                                       3rd Qu.:2013  \r\n                                       Max.   :2014  \r\n\r\n#check the structure of the banding dataset\r\nstr(banding) #This is important, because the variables need to match what they are being used for (i.e., to calculate mean, the variable must be numeric, not a character type)\r\n\r\n\r\n'data.frame':   1602 obs. of  13 variables:\r\n $ band_or_recapture: chr  \"R\" \"R\" \"R\" \"R\" ...\r\n $ band_number      : num  1831 1881 2171 1881 2351 ...\r\n $ sex              : chr  \"F\" \"F\" \"F\" \"M\" ...\r\n $ colour           : chr  \"BLU\" \"BLU\" \"BLU\" \"BLU\" ...\r\n $ wing_chord       : num  116 115 112 123 118 123 110 111 112 117 ...\r\n $ wing_flat        : num  119 119 114 124 119 125 112 113 114 118 ...\r\n $ tail             : num  58 54 55 60 58 56 55 52 55 54 ...\r\n $ p_9              : int  89 90 88 96 92 97 89 87 90 92 ...\r\n $ weight           : num  22 19.6 21.5 21.1 22.1 20.5 20 21.6 19.8 20.5 ...\r\n $ date             : chr  \"2010-06-01\" \"2010-06-01\" \"2010-06-01\" \"2010-06-01\" ...\r\n $ nest_box         : chr  \"PT4G\" \"PT2F\" \"PT15G\" \"PT4G\" ...\r\n $ age_code         : chr  \"ASY\" \"ASY\" \"ASY\" \"AHY\" ...\r\n $ year             : int  2010 2010 2010 2010 2010 2010 2010 2010 2010 2010 ...\r\n\r\nSubsetting and\r\nconditional subsetting elements\r\nThe [ operator can be used to select multiple\r\nelements of an object: The [ operator can be used to\r\nextract specific rows or columns from a data set where DATA[row,\r\ncolumn]\r\nThe $ operator can be used to extract elements by\r\nthe element’s name\r\nLet’s try pulling the first row from the banding dataset\r\n\r\n\r\nbanding[c(1),] #notice how there is a comma after c(1)? This specifies the first row!\r\n\r\n\r\n  band_or_recapture band_number sex colour wing_chord wing_flat tail\r\n1                 R    1831.386   F    BLU        116       119   58\r\n  p_9 weight       date nest_box age_code year\r\n1  89     22 2010-06-01     PT4G      ASY 2010\r\n\r\nLet’s make a mini version of our banding dataset, and call it\r\nbanding2, by subsetting rows 1 through 50 and columns 2, and 5 through\r\n13\r\n\r\n\r\nbanding2 <- banding[c(1:50), c(2,5:13)] #where banding2 is our new dataframe containing data from rows 1:50 and columns 1 and 5:13 from the banding dataset. \r\n\r\n\r\n\r\nYou can also run functions on different variables of your datasets\r\nwhich you can select by using $. You can wrap these in\r\ndifferent functions to calculate various things. Let’s calculate the\r\nmean weight from our banding2 dataset and assign it to a new variable\r\ncalled mean_weight.\r\n\r\n\r\nbanding2$mean_weight <- mean(banding2$weight)\r\n\r\n#Let's take a quick look at banding2 now\r\nhead(banding2)\r\n\r\n\r\n  band_number wing_chord wing_flat tail p_9 weight       date\r\n1    1831.386        116       119   58  89   22.0 2010-06-01\r\n2    1881.065        115       119   54  90   19.6 2010-06-01\r\n3    2171.200        112       114   55  88   21.5 2010-06-01\r\n4    1881.064        123       124   60  96   21.1 2010-06-01\r\n5    2351.397        118       119   58  92   22.1 2010-06-01\r\n6    1881.042        123       125   56  97   20.5 2010-06-01\r\n  nest_box age_code year mean_weight\r\n1     PT4G      ASY 2010      20.815\r\n2     PT2F      ASY 2010      20.815\r\n3    PT15G      ASY 2010      20.815\r\n4     PT4G      AHY 2010      20.815\r\n5    PT15G      AHY 2010      20.815\r\n6     PT2F      AHY 2010      20.815\r\n\r\nWhat if we wanted to calculate the mean weight of the Tree Swallows\r\nas recorded in the banding dataset based on their sex? We could do that\r\nby grouping how we calculate the mean by using the aggregate() function.\r\nThe aggregate function can work to group data as follows:\r\naggregate(y ~ a + b + c + …, df, mean)\r\nWhere y is the variable you want to take the mean of, a, b, c… are\r\nvariables that you are interested in grouping these means by, df is the\r\ndataframe that you are pulling these data from, and ‘mean’ is\r\ninstructing the command that the summary statistic you want to complete\r\nis the mean. Lets try it out!\r\n\r\n\r\n# If we wanted to look at the average weight of female and male birds in the banding dataset we would use aggregate() like this\r\nbanding3 <- aggregate(weight ~ sex, banding, mean) # banding3 is where these values will be stored\r\nbanding3\r\n\r\n\r\n  sex   weight\r\n1   F 20.41623\r\n2   M 20.75646\r\n\r\nTry coding\r\n\r\n\r\n# Try looking at the mean weight of Tree Swallows grouped by sex and year, call this new data frame 'banding4'\r\n\r\n\r\n\r\nNow that you have a good handle on basic subsetting, let’s dig a\r\nlittle deeper and use logical operators to further subset your data.\r\nWhat if you want to focus in on looking at just one sex? How would\r\nyou extract only data related to female birds from these data? One way\r\nto do this would be to use the subset() function and logical operators\r\nto separate out the data of interests from your data set.\r\n< (less than)\r\n<= (less than or equal to)\r\n> (greater than)\r\n>= (greater than or equal to)\r\n== (exactly equal to)\r\n!= (not equal to)\r\nx | y (x OR y)\r\nx & y (x AND y)\r\nIt is important to note that certain logical operators only work on\r\ncertain classes of data. For example, if we looked at sex (class of\r\nfactor) we can’t subset values that are less than or equal to Female\r\n(this would make no sense since Female is not a number or integer!).\r\n\r\n\r\n# pull out female birds from your banding dataset \r\nhead(subset(banding, sex == \"F\")) #the head function limits the amount of rows displayed\r\n\r\n\r\n  band_or_recapture band_number sex colour wing_chord wing_flat tail\r\n1                 R    1831.386   F    BLU        116       119   58\r\n2                 R    1881.065   F    BLU        115       119   54\r\n3                 R    2171.200   F    BLU        112       114   55\r\n7                 B    2351.397   F    BLU        110       112   55\r\n8                 R    2321.083   F    BLU        111       113   52\r\n9                 B    2351.397   F    INT        112       114   55\r\n  p_9 weight       date nest_box age_code year\r\n1  89   22.0 2010-06-01     PT4G      ASY 2010\r\n2  90   19.6 2010-06-01     PT2F      ASY 2010\r\n3  88   21.5 2010-06-01    PT15G      ASY 2010\r\n7  89   20.0 2012-06-01     PT1J      ASY 2010\r\n8  87   21.6 2012-06-01     PT4J      ASY 2010\r\n9  90   19.8 2012-06-01     PT8K      AHY 2010\r\n\r\n# Remember, if you want to store this in a df to look at later I would have to assign it to a vector called \"female_birds\"\r\nfemale_birds <- subset(banding, sex == \"F\")\r\n\r\nhead(female_birds)\r\n\r\n\r\n  band_or_recapture band_number sex colour wing_chord wing_flat tail\r\n1                 R    1831.386   F    BLU        116       119   58\r\n2                 R    1881.065   F    BLU        115       119   54\r\n3                 R    2171.200   F    BLU        112       114   55\r\n7                 B    2351.397   F    BLU        110       112   55\r\n8                 R    2321.083   F    BLU        111       113   52\r\n9                 B    2351.397   F    INT        112       114   55\r\n  p_9 weight       date nest_box age_code year\r\n1  89   22.0 2010-06-01     PT4G      ASY 2010\r\n2  90   19.6 2010-06-01     PT2F      ASY 2010\r\n3  88   21.5 2010-06-01    PT15G      ASY 2010\r\n7  89   20.0 2012-06-01     PT1J      ASY 2010\r\n8  87   21.6 2012-06-01     PT4J      ASY 2010\r\n9  90   19.8 2012-06-01     PT8K      AHY 2010\r\n\r\n# what if you wanted to look at female birds that weighed over 20g?\r\nfemale_birds <- subset(banding, sex == \"F\" & weight > 20)\r\n\r\nhead(female_birds)\r\n\r\n\r\n   band_or_recapture band_number sex colour wing_chord wing_flat tail\r\n1                  R    1831.386   F    BLU        116       119   58\r\n3                  R    2171.200   F    BLU        112       114   55\r\n8                  R    2321.083   F    BLU        111       113   52\r\n12                 R    1771.437   F    BLU        111       114   53\r\n13                 R    2311.936   F    BRO        115       117   54\r\n19                 R    2311.933   F    INT        116       119   57\r\n   p_9 weight       date nest_box age_code year\r\n1   89   22.0 2010-06-01     PT4G      ASY 2010\r\n3   88   21.5 2010-06-01    PT15G      ASY 2010\r\n8   87   21.6 2012-06-01     PT4J      ASY 2010\r\n12  87   20.2 2012-06-01    PT11I      ASY 2010\r\n13  91   20.2 2012-06-01    PT10G      AHY 2010\r\n19  93   20.4 2012-06-01    PT13G      AHY 2010\r\n\r\n#Notice how the vector female_birds changed from 853 observations to 495 observations?\r\n\r\n\r\n\r\nTry coding\r\n\r\n\r\n# Try to subset a dataframe called 'male_birds' that consists of male birds with the chord_length less than or equal to 150\r\n\r\n\r\n\r\nQuestion\r\nHow many male birds have a chord_length less than or equal to\r\n150?\r\nAnswer:\r\nHaving fun yet? I know I am! Let’s look at the basics of a plot. This\r\nimage was pulled from here.\r\n\r\nNow that we are refreshed in the elements of a graph, let’s graph a\r\nrelatively simple bar plot with our banding data frame.\r\nLet’s look at the number of banded and recaptured birds there were\r\neach year. We will use ggplot to visualize the\r\ndata.\r\n\r\n\r\n#First, we will create a table base on the band_or_recapture column and the year column\r\ntbl1 <- with(banding, table(band_or_recapture, year))  \r\ntbl1\r\n\r\n\r\n                 year\r\nband_or_recapture 2010 2011 2012 2013 2014\r\n                B   62  125  118   68  101\r\n                R  179  264  292  139  254\r\n\r\n#Next, we can plot our table \r\nggplot(as.data.frame(tbl1), aes(x =factor(year), y = Freq, fill = band_or_recapture))+ #we've changed the format of our table to a dataframe so we can plot it. \r\n  geom_col(position = 'dodge') #geom_column is the type of graph, and position='dodge' allows us to visualize the barplots side by side.\r\n\r\n\r\n\r\n\r\nCongrats! You’ve made your first graph. We can change elements of the\r\ngraph by adding labels and titles, changing the theme and colours of our\r\nbars.\r\n\r\n\r\n#Add labels and change colours\r\nggplot(as.data.frame(tbl1), aes(x =factor(year), y = Freq, fill = band_or_recapture))+ \r\n  geom_col(position = 'dodge') +\r\n  xlab('Year') +\r\n  ylab('Number of birds') +\r\n  scale_fill_manual(name= \"Banded or Recaptured\", values=c(\"B\" = 'lightskyblue', \"R\" = 'plum3'))+\r\n  ggtitle(\"Birds banded or recaptured from 2010-2014\") +\r\n  theme_classic() #gets rid of grey background\r\n\r\n\r\n\r\n\r\nQuestion\r\nWhat trends do you see? Why do you think there are more recaptured\r\nbirds compared to banded birds every year?\r\nAnswer:\r\n(If you’d like to learn more about ggplot, this\r\ntutorial is great!)\r\nNext, let’s change gears and take a quick look at the egg nestling\r\ndataset.\r\n\r\n\r\nhead(nestling)\r\n\r\n\r\n  nest_box band_number year clutch_number day_1_weight day_12_weight\r\n1     PT7F  2351.39972 2014            NA         <NA>          <NA>\r\n2     PT7F  2351.39973 2014            NA         <NA>          <NA>\r\n3     PT7F  2351.39974 2014            NA         <NA>          <NA>\r\n4    PT14G  2351.39975 2014            NA         <NA>          <NA>\r\n5    PT14G  2351.39976 2014            NA         <NA>          <NA>\r\n6    PT14G  2351.39977 2014            NA         <NA>          <NA>\r\n  site nest_code\r\n1 <NA>      <NA>\r\n2 <NA>      <NA>\r\n3 <NA>      <NA>\r\n4 <NA>      <NA>\r\n5 <NA>      <NA>\r\n6 <NA>      <NA>\r\n\r\nIf we look at the structure of our new dataframe, nestling:\r\n\r\n\r\nstr(nestling)\r\n\r\n\r\n'data.frame':   32536 obs. of  8 variables:\r\n $ nest_box     : chr  \"PT7F\" \"PT7F\" \"PT7F\" \"PT14G\" ...\r\n $ band_number  : chr  \"2351.39972\" \"2351.39973\" \"2351.39974\" \"2351.39975\" ...\r\n $ year         : int  2014 2014 2014 2014 2014 2014 2014 2014 2014 2014 ...\r\n $ clutch_number: int  NA NA NA NA NA NA NA NA NA NA ...\r\n $ day_1_weight : chr  NA NA NA NA ...\r\n $ day_12_weight: chr  NA NA NA NA ...\r\n $ site         : chr  NA NA NA NA ...\r\n $ nest_code    : chr  NA NA NA NA ...\r\n\r\nWe don’t have entries for all rows of our dataframe. They will appear\r\nas NAs. We see the weight is a character vector. Let’s\r\nchange that to numeric using the as.numeric() function. Let’s start with\r\nthe day_1_weight column:\r\n\r\n\r\nnestling$day_1_weight <- as.numeric(nestling$day_1_weight)\r\n\r\n\r\n\r\nNow the day_12_weight column:\r\n\r\n\r\nnestling$day_12_weight <- as.numeric(nestling$day_12_weight)\r\n\r\n\r\n\r\nWe want to summarize our data so we can calculate the mean of each\r\nweight by year\r\n\r\n\r\nnestling_weight <- nestling %>%\r\n  group_by(year) %>% #groups weights by year\r\n  filter(is.na(day_1_weight) == F,  #gets rid of NAs\r\n         is.na(day_12_weight) == F) %>%\r\n  summarise(mean_day_1 = mean(day_1_weight), #calculates the mean of each year \r\n            mean_day_12 = mean(day_12_weight)) \r\n\r\n\r\n\r\nWe can convert the mean weights to long format, which gives us a\r\nweight column, with both weight variables, and a total column which\r\ncontains the weights\r\n\r\n\r\nnestling_weight2 <- gather(nestling_weight, weight, total, mean_day_1:mean_day_12)\r\n\r\n\r\n\r\nLook at the structure of our new dataframe, nestling_weight2\r\n\r\n\r\nstr(nestling_weight2)\r\n\r\n\r\ntibble [74 × 3] (S3: tbl_df/tbl/data.frame)\r\n $ year  : int [1:74] 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 ...\r\n $ weight: chr [1:74] \"mean_day_1\" \"mean_day_1\" \"mean_day_1\" \"mean_day_1\" ...\r\n $ total : num [1:74] 21.83 1.76 1.69 2.18 2.03 ...\r\n\r\nOk, now we can plot it using ggplot.\r\n\r\n\r\nggplot(data = nestling_weight2,\r\n       aes(x = year, y = total, group = weight)) + #Year goes on the x axis, weight(totals) on the y axis, and we group by each the means of each day\r\n  geom_line(aes(linetype = weight, color = weight)) + #aes changes the aesthetics of the lines so that linetype and colors are different from each other\r\n  theme_classic()\r\n\r\n\r\n\r\n\r\nHmm, looks like something is not quite right in our plot. There seems\r\nto be an outlier within the data. If we assume this is a data entry\r\nerror, we can get rid of it. Since it looks like an earlier date, let’s\r\njust look at the first few rows (n = 10) and see if we can find the\r\noutlier.\r\n\r\n\r\nhead(nestling_weight2, n = 10)\r\n\r\n\r\n# A tibble: 10 × 3\r\n    year weight     total\r\n   <int> <chr>      <dbl>\r\n 1  1977 mean_day_1 21.8 \r\n 2  1978 mean_day_1  1.76\r\n 3  1979 mean_day_1  1.69\r\n 4  1980 mean_day_1  2.18\r\n 5  1981 mean_day_1  2.03\r\n 6  1982 mean_day_1  2.54\r\n 7  1983 mean_day_1  1.90\r\n 8  1984 mean_day_1  1.57\r\n 9  1985 mean_day_1  1.68\r\n10  1986 mean_day_1  1.59\r\n\r\nAh ha! The first row contains a mean_day_1 weight of 21.828571. This\r\nis likely an error. Let’s get rid of it and then re-plot it.\r\n\r\n\r\nnestling_weight2 <- nestling_weight2[-1,]\r\nggplot(data = nestling_weight2,\r\n       aes(x = year, y = total, group = weight)) + #Year goes on the x axis, weight(totals) on the y axis, and we group by each the means of each day\r\n  geom_line(aes(linetype = weight, color = weight)) + #aes changes the aesthetics of the lines so that linetype and colors are different from each other\r\n  theme_classic()\r\n\r\n\r\n\r\n\r\nQuestion\r\nMuch better! Do you see any trends within this datasets over time?\r\nWhat other variables could you look at within the nestling dataset?\r\nAnswer:\r\nCheck out this cool video on nesting Tree Swallows!\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "lessons/2022-04-07-tree-swallow-dataset/tree-swallow-dataset_files/figure-html5/unnamed-chunk-11-1.png",
    "last_modified": "2022-06-03T14:37:47-07:00",
    "input_file": {}
  }
]
